{"class_name": "Model", "config": {"name": "model_9", "layers": [{"name": "input_53", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 40], "dtype": "float32", "sparse": false, "name": "input_53"}, "inbound_nodes": []}, {"name": "input_54", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 40], "dtype": "float32", "sparse": false, "name": "input_54"}, "inbound_nodes": []}, {"name": "embedding_53", "class_name": "Embedding", "config": {"name": "embedding_53", "trainable": false, "batch_input_shape": [null, 40], "dtype": "float32", "input_dim": 95597, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 40}, "inbound_nodes": [[["input_53", 0, 0, {}]]]}, {"name": "embedding_54", "class_name": "Embedding", "config": {"name": "embedding_54", "trainable": false, "batch_input_shape": [null, 40], "dtype": "float32", "input_dim": 95597, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 40}, "inbound_nodes": [[["input_54", 0, 0, {}]]]}, {"name": "conv1d_33", "class_name": "Conv1D", "config": {"name": "conv1d_33", "trainable": true, "filters": 64, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_53", 0, 0, {}]]]}, {"name": "conv1d_35", "class_name": "Conv1D", "config": {"name": "conv1d_35", "trainable": true, "filters": 64, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_54", 0, 0, {}]]]}, {"name": "dropout_121", "class_name": "Dropout", "config": {"name": "dropout_121", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1d_33", 0, 0, {}]]]}, {"name": "dropout_124", "class_name": "Dropout", "config": {"name": "dropout_124", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1d_35", 0, 0, {}]]]}, {"name": "conv1d_34", "class_name": "Conv1D", "config": {"name": "conv1d_34", "trainable": true, "filters": 64, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_121", 0, 0, {}]]]}, {"name": "conv1d_36", "class_name": "Conv1D", "config": {"name": "conv1d_36", "trainable": true, "filters": 64, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_124", 0, 0, {}]]]}, {"name": "input_55", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 40], "dtype": "float32", "sparse": false, "name": "input_55"}, "inbound_nodes": []}, {"name": "input_56", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 40], "dtype": "float32", "sparse": false, "name": "input_56"}, "inbound_nodes": []}, {"name": "input_51", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 40], "dtype": "float32", "sparse": false, "name": "input_51"}, "inbound_nodes": []}, {"name": "global_max_pooling1d_17", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_17", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_34", 0, 0, {}]]]}, {"name": "global_max_pooling1d_18", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_18", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_36", 0, 0, {}]]]}, {"name": "embedding_55", "class_name": "Embedding", "config": {"name": "embedding_55", "trainable": true, "batch_input_shape": [null, 40], "dtype": "float32", "input_dim": 95597, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 40}, "inbound_nodes": [[["input_55", 0, 0, {}]]]}, {"name": "embedding_56", "class_name": "Embedding", "config": {"name": "embedding_56", "trainable": true, "batch_input_shape": [null, 40], "dtype": "float32", "input_dim": 95597, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 40}, "inbound_nodes": [[["input_56", 0, 0, {}]]]}, {"name": "embedding_51", "class_name": "Embedding", "config": {"name": "embedding_51", "trainable": false, "batch_input_shape": [null, 40], "dtype": "float32", "input_dim": 95597, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 40}, "inbound_nodes": [[["input_51", 0, 0, {}]]]}, {"name": "dense_83", "class_name": "Dense", "config": {"name": "dense_83", "trainable": true, "units": 300, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["global_max_pooling1d_17", 0, 0, {}]]]}, {"name": "dense_84", "class_name": "Dense", "config": {"name": "dense_84", "trainable": true, "units": 300, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["global_max_pooling1d_18", 0, 0, {}]]]}, {"name": "dropout_127", "class_name": "Dropout", "config": {"name": "dropout_127", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding_55", 0, 0, {}]]]}, {"name": "dropout_129", "class_name": "Dropout", "config": {"name": "dropout_129", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding_56", 0, 0, {}]]]}, {"name": "time_distributed_17", "class_name": "TimeDistributed", "config": {"name": "time_distributed_17", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_81", "trainable": true, "units": 300, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_51", 0, 0, {}]]]}, {"name": "dropout_123", "class_name": "Dropout", "config": {"name": "dropout_123", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_83", 0, 0, {}]]]}, {"name": "dropout_126", "class_name": "Dropout", "config": {"name": "dropout_126", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_84", 0, 0, {}]]]}, {"name": "lstm_17", "class_name": "LSTM", "config": {"name": "lstm_17", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 300, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dropout_127", 0, 0, {}]]]}, {"name": "lstm_18", "class_name": "LSTM", "config": {"name": "lstm_18", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 300, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dropout_129", 0, 0, {}]]]}, {"name": "lambda_17", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oDc3VtKQHaAXipAHIGAAAA+h88aXB5dGhvbi1pbnB1dC01Ny0yZmU2MjI3ZTFiN2I+2gg8\nbGFtYmRhPg4AAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": [300], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["time_distributed_17", 0, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oDc3VtKQHaAXipAHIGAAAA+h88aXB5dGhvbi1pbnB1dC01Ny0yZmU2MjI3ZTFiN2I+2gg8\nbGFtYmRhPhkAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": [300], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["time_distributed_17", 0, 0, {}]]]}, {"name": "batch_normalization_57", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_57", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_123", 0, 0, {}]]]}, {"name": "batch_normalization_58", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_58", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_126", 0, 0, {}]]]}, {"name": "dropout_128", "class_name": "Dropout", "config": {"name": "dropout_128", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_17", 0, 0, {}]]]}, {"name": "dropout_130", "class_name": "Dropout", "config": {"name": "dropout_130", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_18", 0, 0, {}]]]}, {"name": "concatenate_9", "class_name": "Concatenate", "config": {"name": "concatenate_9", "trainable": true, "axis": -1}, "inbound_nodes": [[["lambda_17", 0, 0, {}], ["lambda_18", 0, 0, {}], ["batch_normalization_57", 0, 0, {}], ["batch_normalization_58", 0, 0, {}], ["dropout_128", 0, 0, {}], ["dropout_130", 0, 0, {}]]]}, {"name": "dense_85", "class_name": "Dense", "config": {"name": "dense_85", "trainable": true, "units": 300, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"name": "p_re_lu_41", "class_name": "PReLU", "config": {"name": "p_re_lu_41", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_85", 0, 0, {}]]]}, {"name": "dropout_135", "class_name": "Dropout", "config": {"name": "dropout_135", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["p_re_lu_41", 0, 0, {}]]]}, {"name": "batch_normalization_63", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_63", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_135", 0, 0, {}]]]}, {"name": "dense_90", "class_name": "Dense", "config": {"name": "dense_90", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_63", 0, 0, {}]]]}], "input_layers": [["input_51", 0, 0], ["input_53", 0, 0], ["input_54", 0, 0], ["input_55", 0, 0], ["input_56", 0, 0]], "output_layers": [["dense_90", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}